tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Download with resuming and segmented downloading
brew "aria2"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash and Zsh completion for Cargo
brew "cargo-completion"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# It is system for maintaining DNS zones
brew "dnscontrol"
# Charset analyzer and converter
brew "enca"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Command-line accounting tool
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# General-purpose data compression with high compression ratio
brew "xz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python version management
brew "pyenv"
# QR Code generation
brew "qrencode"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# The Rust toolchain installer
brew "rustup-init"
# The cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compress/expand executable files
brew "upx"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
cask "1password"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "arq"
cask "bartender"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "java11"
cask "joplin"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "macvim"
cask "marked"
cask "pdf-expert"
cask "podman"
cask "postman"
cask "proxyman"
cask "sublime-merge"
cask "sublime-text"
cask "telegram-desktop"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
mas "1Blocker", id: 1107421413
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Microsoft To Do", id: 1274495053
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Raindrop.io for Safari", id: 957810159
mas "SafariMarkdownLinker", id: 1289119450
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Tweetbot", id: 557168941
