tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Crossassembler for multiple environments
brew "acme"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# It is system for maintaining DNS zones
brew "dnscontrol"
# Charset analyzer and converter
brew "enca"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# JavaScript Task Runner
brew "grunt-cli"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line accounting tool
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Spell checker and morphological analyzer
brew "hunspell"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line, double-entry accounting tool
brew "ledger"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# QR Code generation
brew "qrencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# The Pass extension for managing one-time-password (OTP) tokens
brew "pass-otp"
# Manage compile and link flags for libraries
brew "pkg-config"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Fuzzy Finder in rust!
brew "sk"
# The cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Compress/expand executable files
brew "upx"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
cask "1password"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "arq"
cask "bartender"
cask "bettertouchtool"
cask "bitwarden"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "font-cascadia"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-cascadia-pl"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "java11"
cask "java8"
cask "joplin"
cask "karabiner-elements"
cask "kitty"
cask "mactex-no-gui"
cask "macvim"
cask "marked"
cask "podman"
cask "postman"
cask "sublime-merge"
cask "sublime-text"
cask "telegram-desktop"
cask "the-unarchiver"
cask "visual-studio-code"
